import React from 'react'

const Footer = () => {
  return (
    <>
    <footer className='footer'>
        <div className='container'>
            <div className='footer__actual'>
                <div className='actual__wrapper'>
                    <div className='actual__left'>
                        <p className='subtitle actual__subtitle'>актуально</p>
                        <h2 className='actual__title'>Получайте полезные рассылки о путешествиях</h2>
                    </div>
                    <div className='actual__right'>
                        <p className='actual__right-text'>Введите e-mail адрес</p>
                        <form className='actual__form' onSubmit={e => e.preventDefault()}>
                            <input className='actual__form-input' placeholder='name@domain.com'/>
                            <button className='actual__form-btn'>Подписаться на новости</button>
                        </form>
                        <p className='actual__conditions'>
                            подписываясь на новости, вы автоматически 
                            соглашаетесь с &nbsp;
                            <a className='actual__conditions-link'>
                                условиями обработки персональных данных и правилами рекламных рассылок
                            </a>
                        </p>
                    </div>
                </div>
            </div>
        </div>      
        <div className='container'>
            <div className='footer__wrapper'>
                <div className='footer__item'>
                    <h3 className='footer__item-title'>Компания «РумТибет»</h3>
                    <p className='footer__item-text'>
                        Его корни уходят в один фрагмент классической латыни 45
                         года н.э., то есть более двух тысячелетий назад. Ричард МакКлинток, 
                         профессор латыни из колледжа Hampden-Sydney.
                    </p>
                    <div className='footer__item-links'>
                        <a href='#!'>info@domain.com</a>
                        <a href='#!'>+7 (123) 456-78-90</a>
                    </div>
                    <div className='footer__item-socials'>
                        <a href='#!'><img className='footer__item-link' src='s1.svg'/></a>
                        <a href='#!'><img className='footer__item-link' src='s2.svg'/></a>
                        <a href='#!'><img className='footer__item-link' src='s3.svg'/></a>
                        <a href='#!'><img className='footer__item-link' src='s4.svg'/></a>
                    </div>
                </div>
                <div className='footer__item'>
                    <nav className='footer__nav'>
                        <h3 className='footer__nav-title footer__item-title'>Наши услуги</h3>
                        <ul className='footer__list'>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Прогулки в горы летом</a>
                            </li>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Зимние походы в горы</a>
                            </li>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Посещение храмов в горах</a>
                            </li>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Экстремальные виды туризма</a>
                            </li>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link footer__list-link--new' href='#!'>Походы в джунглях Амазонии</a>
                            </li>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Поездка в Африку</a>
                            </li>
                        </ul>
                    </nav>
                </div>
                <div className='footer__item'>
                    <nav className='footer__nav'>
                        <h3 className='footer__nav-title footer__item-title'>Важно для путешествий</h3>
                        <ul className='footer__list'>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Как собрать в долгий поход?</a>
                            </li>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Жизненно важные предметы для похода</a>
                            </li>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Медицинская страховка, гарантии безопасности</a>
                            </li>
                            <li className='footer__list-item'>
                                <svg width="6" height="10" viewBox="0 0 6 10" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M5.7154 4.6098L1.26527 0.159755C1.16235 0.0567475 1.02495 0 0.878448 0C0.731945 0 0.594548 0.0567475 0.491622 0.159755L0.163901 0.487394C-0.0493491 0.700889 -0.0493491 1.04788 0.163901 1.26105L3.90078 4.99793L0.159755 8.73895C0.0568288 8.84196 0 8.97928 0 9.1257C0 9.27228 0.0568288 9.4096 0.159755 9.51269L0.487476 9.84024C0.590483 9.94325 0.727799 10 0.874302 10C1.0208 10 1.1582 9.94325 1.26113 9.84024L5.7154 5.38613C5.81857 5.2828 5.87524 5.14484 5.87491 4.99817C5.87524 4.85094 5.81857 4.71305 5.7154 4.6098Z" fill="#FDFDFD"/>
                                </svg>
                                <a className='footer__list-link' href='#!'>Если вы врач - загляните сюда</a>
                            </li>
                        </ul>
                    </nav>
                </div>
            </div>
        </div>
    </footer>
    <div className='footer__rights'>
        <div className='container'>
            <div className='rights__wrapper'>
                <p>ИП Константинопольский К.К., 2023</p>
                <a href='#!'>Политика обработки персональных данных</a>
            </div>
        </div>
    </div>
    </>
  )
}

export default Footer